

var data = [ ];

var dataStr= "1、苍天翔龙 - 赵云<br>\
<br>\
英雄定位:战士/刺客<br>\
特点:突进<br>\
生存能力:5<br>\
攻击伤害:5<br>\
技能效果:6<br>\
上手难度:5<br>\
<br>\
<br>\
2、王者独尊 - 嬴政<br>\
<br>\
英雄定位:法师<br>\
特点:远程消耗<br>\
生存能力:2<br>\
攻击伤害:6<br>\
技能效果:8<br>\
上手难度:7<br>\
<br>\
<br>\
3、断案大师 - 狄仁杰<br>\
<br>\
英雄定位:射手<br>\
特点:暂无<br>\
生存能力:1<br>\
攻击伤害:10<br>\
技能效果:3<br>\
上手难度:3<br>\
<br>\
<br>\
4、月光之女 - 露娜<br>\
<br>\
英雄定位:战士/法师<br>\
特点:突进/收割<br>\
生存能力:1<br>\
攻击伤害:4<br>\
技能效果:10<br>\
上手难度:8<br>\
<br>\
<br>\
5、神梦一刀 - 橘右京<br>\
<br>\
英雄定位:战士/刺客<br>\
特点:远程消耗/收割<br>\
生存能力:6<br>\
攻击伤害:6<br>\
技能效果:5<br>\
上手难度:2<br>\
<br>\
<br>\
6、青莲剑仙 - 李白<br>\
<br>\
英雄定位:刺客/战士<br>\
特点:突进/收割<br>\
生存能力:3<br>\
攻击伤害:6<br>\
技能效果:8<br>\
上手难度:6<br>\
<br>\
<br>\
7、千金重弩 - 孙尚香<br>\
<br>\
英雄定位:射手<br>\
特点:突进/收割<br>\
生存能力:2<br>\
攻击伤害:8<br>\
技能效果:5<br>\
上手难度:7<br>\
<br>\
<br>\
8、不羁之风 - 夏侯惇<br>\
<br>\
英雄定位:战士/坦克<br>\
特点:突进/团控<br>\
生存能力:4<br>\
攻击伤害:6<br>\
技能效果:5<br>\
上手难度:4<br>\
<br>\
<br>\
9、铁血都督 - 周瑜<br>\
<br>\
英雄定位:法师<br>\
特点:远程消耗<br>\
生存能力:2<br>\
攻击伤害:5<br>\
技能效果:9<br>\
上手难度:7<br>\
<br>\
<br>\
10、鲜血枭雄 - 曹操<br>\
<br>\
英雄定位:战士<br>\
特点:吸血<br>\
生存能力:6<br>\
攻击伤害:6<br>\
技能效果:5<br>\
上手难度:6<br>\
<br>\
<br>\
11、远游之枪 - 马可波罗<br>\
<br>\
英雄定位:射手<br>\
特点:远程消耗<br>\
生存能力:7<br>\
攻击伤害:5<br>\
技能效果:6<br>\
上手难度:6<br>\
<br>\
<br>\
12、拳僧 - 达摩<br>\
<br>\
英雄定位:战士<br>\
特点:突进/团控<br>\
生存能力:9<br>\
攻击伤害:6<br>\
技能效果:2<br>\
上手难度:5<br>\
<br>\
<br>\
13、根源之目 - 杨戬<br>\
<br>\
英雄定位:战士<br>\
特点:突进/收割<br>\
生存能力:7<br>\
攻击伤害:6<br>\
技能效果:5<br>\
上手难度:5<br>\
<br>\
<br>\
14、绝世舞姬 - 貂蝉<br>\
<br>\
英雄定位:法师/刺客<br>\
特点:突进<br>\
生存能力:2<br>\
攻击伤害:6<br>\
技能效果:7<br>\
上手难度:6<br>\
<br>\
<br>\
15、言灵之书 - 张良<br>\
<br>\
英雄定位:法师<br>\
特点:团控<br>\
生存能力:2<br>\
攻击伤害:3<br>\
技能效果:10<br>\
上手难度:8<br>\
<br>\
<br>\
16、明媚烈焰 - 不知火舞<br>\
<br>\
英雄定位:法师/刺客<br>\
特点:暂无<br>\
生存能力:3<br>\
攻击伤害:5<br>\
技能效果:9<br>\
上手难度:9<br>\
<br>\
<br>\
17、鹰之守护 - 娜可露露<br>\
<br>\
英雄定位:刺客<br>\
特点:突进<br>\
生存能力:3<br>\
攻击伤害:7<br>\
技能效果:6<br>\
上手难度:5<br>\
<br>\
<br>\
18、齐天大圣 - 孙悟空<br>\
<br>\
英雄定位:战士/刺客<br>\
特点:突进/团控<br>\
生存能力:5<br>\
攻击伤害:5<br>\
技能效果:5<br>\
上手难度:4<br>\
<br>\
<br>\
19、绝代智谋 - 诸葛亮<br>\
<br>\
英雄定位:法师<br>\
特点:收割/远程消耗<br>\
生存能力:2<br>\
攻击伤害:6<br>\
技能效果:8<br>\
上手难度:8<br>\
<br>\
<br>\
20、冰雪之华 - 王昭君<br>\
<br>\
英雄定位:法师<br>\
特点:团控<br>\
生存能力:2<br>\
攻击伤害:3<br>\
技能效果:10<br>\
上手难度:8<br>\
<br>\
<br>\
21、传说之刃 - 花木兰<br>\
<br>\
英雄定位:战士/刺客<br>\
特点:突进/收割<br>\
生存能力:2<br>\
攻击伤害:9<br>\
技能效果:5<br>\
上手难度:9<br>\
<br>\
<br>\
22、暗影刀锋 - 兰陵王<br>\
<br>\
英雄定位:刺客<br>\
特点:突进/收割<br>\
生存能力:2<br>\
攻击伤害:10<br>\
技能效果:4<br>\
上手难度:6<br>\
";

var d=dataStr.split('<br><br><br>')
   for (var i=0;i<d.length;i++){
     var c=d[i].split('<br><br>');
        data.push({
            img:c[0].replace('、' , ' ')+'.jpg',
            caption:c[0].split('、')[1],
            desc:c[1]
        });
     }
